In [2]:
import pandas as pd

In [3]:
data = pd.read_csv("titanic.tsv", header=0, sep="\t")

In [4]:
data

,Survived,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,530,2,Hocking\t Mr. Richard George,male,23.0,2,1,29104,11.5000,NaN,S
1,0,466,3,Goncalves\t Mr. Manuel Estanslas,male,38.0,0,0,SOTON/O.Q. 3101306,7.0500,NaN,S
2,0,753,3,Vande Velde\t Mr. Johannes Joseph,male,33.0,0,0,345780,9.5000,NaN,S
3,0,855,2,Carter\t Mrs. Ernest Courtenay (Lilian Hughes),female,44.0,1,0,244252,26.0000,NaN,S
4,0,333,1,Graham\t Mr. George Edward,male,38.0,0,1,PC 17582,153.4625,C91,S
...,...,...,...,...,...,...,...,...,...,...,...,...
618,0,660,1,Newell\t Mr. Arthur Webster,male,58.0,0,2,35273,113.2750,D48,C
619,1,85,2,Ilett\t Miss. Bertha,female,17.0,0,0,SO/C 14885,10.5000,NaN,S
620,1,521,1,Perreault\t Miss. Anne,female,30.0,0,0,12749,93.5000,B73,S
621,1,644,3,Foo\t Mr. Choong,male,NaN,0,0,1601,56.4958,NaN,S
622,1,831,3,Yasbeck\t Mrs. Antoni (Selini Alexander),female,15.0,1,0,2659,14.4542,NaN,C

In [5]:
len(data)

623

Zapełniam wartości nan w kolumnie wiek średnią wieku pasażerów

In [6]:
data["Age"] = data["Age"].fillna(data["Age"].mean().round())

Kolumny "PassengerId", "Ticket", "Name" sa unikalne i nie niosą za dużo informacji dla modelu. Kolumna "Cabin" jest w większości pusta.

In [7]:
data = data.drop(columns=["PassengerId", "Ticket", "Cabin", "Name"])

Zamieniam wartości kolumny "Sex" na 0 -male i 1 - female

In [8]:
data["Sex"] = data["Sex"].apply(lambda x: 1 if x == "female" else 0)

In [9]:
data

     Survived  Pclass  Sex   Age  SibSp  Parch      Fare Embarked
0           0       2    0  23.0      2      1   11.5000        S
1           0       3    0  38.0      0      0    7.0500        S
2           0       3    0  33.0      0      0    9.5000        S
3           0       2    1  44.0      1      0   26.0000        S
4           0       1    0  38.0      0      1  153.4625        S
..        ...     ...  ...   ...    ...    ...       ...      ...
618         0       1    0  58.0      0      2  113.2750        C
619         1       2    1  17.0      0      0   10.5000        S
620         1       1    1  30.0      0      0   93.5000        S
621         1       3    0  29.0      0      0   56.4958        S
622         1       3    1  15.0      1      0   14.4542        C

[623 rows x 8 columns]

In [10]:
pd.unique(data["Embarked"])

array(['S', 'C', 'Q', nan], dtype=object)

Wartości nan w kolumnie "Embarked" jest mało więc można usunąć wiersze je zawierające

In [11]:
len(data["Embarked"])

623

In [12]:
data["Embarked"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 623 entries, 0 to 622
Series name: Embarked
Non-Null Count  Dtype
--------------  -----
621 non-null    object
dtypes: object(1)
memory usage: 5.0+ KB

In [13]:
data = data.dropna(subset=["Embarked"])

Na koniec zamieniam dane kategoryczne na boole'owskie za pomoca get_dummies

In [14]:
data = pd.get_dummies(data, columns=["Embarked"])

In [15]:
data

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
0,0,2,0,23.0,2,1,11.5000,0,0,1
1,0,3,0,38.0,0,0,7.0500,0,0,1
2,0,3,0,33.0,0,0,9.5000,0,0,1
3,0,2,1,44.0,1,0,26.0000,0,0,1
4,0,1,0,38.0,0,1,153.4625,0,0,1
...,...,...,...,...,...,...,...,...,...,...
618,0,1,0,58.0,0,2,113.2750,1,0,0
619,1,2,1,17.0,0,0,10.5000,0,0,1
620,1,1,1,30.0,0,0,93.5000,0,0,1
621,1,3,0,29.0,0,0,56.4958,0,0,1
622,1,3,1,15.0,1,0,14.4542,1,0,0

Wszystkie dane są numeryczne bez wartości nan

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 621 entries, 0 to 622
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Survived    621 non-null    int64
 1   Pclass      621 non-null    int64
 2   Sex         621 non-null    int64
 3   Age         621 non-null    float64
 4   SibSp       621 non-null    int64
 5   Parch       621 non-null    int64
 6   Fare        621 non-null    float64
 7   Embarked_C  621 non-null    uint8
 8   Embarked_Q  621 non-null    uint8
 9   Embarked_S  621 non-null    uint8
dtypes: float64(2), int64(5), uint8(3)
memory usage: 40.6 KB

In [17]:
data.to_csv("titanic_clean.csv", index=False)